const { Client, Message, MessageEmbed } = require('discord.js');

module.exports = {
    name: 'правила',
    /** 
     * @param {Client} client 
     * @param {Message} message 
     * @param {String[]} args 
     */
    run: async(client, message, args) => {

        const member = message.mentions.members.first() || message.member

        if(message.member.id != '286853335854612480') return message.channel.send("У вас недостаточно прав чтобы использовать данную команду!");

        message.channel.send('@everyone')

        message.channel.send(`https://i.imgur.com/7l0L3E9.png`)

        message.channel.send('```js\nПравила игры:\n\n Раздел 1. Основные положения\n1. Каждый игрок данного бота обязан быть ознакомлен с правилами игры.\n2. Каждый пункт этих правил должен выполняться беззаговорочно.\n3. В случае нарушений свода правил, разработчик в праве выдать наказание в виде игровой блокировки без указания причины.\n4. Игрок в праве обжаловать свою игровую блокировку за - 72 часа.\n\n Раздел 2. Использования багов\n1. За использование багов которые дадут преимущество перед другими игроками в чём либо Вы можете получить игровую блокировку навсегда.\n2. За предоставление информации о каком-либо баге, разработчик в праве выдать вознаграждение.\n3. За скрытие информации, что Вы использовали баг, разработчик в праве обнулить Ваш аккаунт либо выдать игровую блокировку.\n4. Разработчик в праве предупреждать о том, что могут быть баги в какой-либо команде и как лучше избежать игровую блокировку при использовании данной команды.\n5. Если вы случайно воспроизвели баг, не волнуйтесь, Ваш аккаунт не будет заблокирован, главное чтобы Вы своевременно предупредили разработчика бота как все произошло.\n\nПравила будут дополнены через некоторое время...```')

        message.delete()

    }
}